In [1]:
import pandas as pd

‚ö° **SERIES:** \
Imagine que voc√™ tem uma lista de n√∫meros, por exemplo: [10, 20, 30, 40, 50]. Uma lista comum em Python n√£o possui r√≥tulos, √© apenas uma sequ√™ncia de valores. Agora, se voc√™ quiser associar um r√≥tulo a cada valor, como "A", "B", "C", "D" e "E", para que cada n√∫mero tenha um nome, voc√™ poderia usar uma Series
> serie = pd.Series(dados, index)

In [2]:
serieCreate = pd.Series(['Beto', 'Patrick', 'Julio'], ['A', 'B', 'C'])

display(serieCreate)

labelA = serieCreate['A'] # Obter dado atrav√©s do Indice(rotulo)
labelAB = serieCreate[['A', 'B']] # Obter dados atrav√©s do Indice(rotulo)

A       Beto
B    Patrick
C      Julio
dtype: object

üîÄ **DE SERIES PARA DATAFRAME:**
> üîπ serieCreate[['A', 'B']] -> utilizando [['xxxyyy']]
> 
> üîπ display(coluna_A.to_frame()) -> utilizando o metodo to_frame()

‚ùÑÔ∏è **CRIANDO DATAFRAME:**

In [3]:
from numpy.random import randn

# randn(linhas, columns) -> gerar numeros 

df = pd.DataFrame(randn(5, 5), index=['A', 'B' , 'C', 'D', 'E'], columns=["Y", 'Z', 'W','X', 'Q'])

display(df)

          Y         Z         W         X         Q
A -0.939426  1.743261 -0.775443  0.230579  1.727765
B  0.658182 -0.122428  0.539046 -0.058211  0.146142
C -0.167507 -0.424723  0.185905 -0.738616 -2.292587
D  1.523331 -0.954317 -0.599702  0.221725  0.101403
E  1.556134  1.197178 -0.228824 -0.183818 -0.485991

In [4]:
display(df['Y']) # Obter dados atraves da Coluna. DType:return series
display(df[['Y']]) # Obter dados atraves da Coluna. DType:return DataFrame

A   -0.939426
B    0.658182
C   -0.167507
D    1.523331
E    1.556134
Name: Y, dtype: float64

          Y
A -0.939426
B  0.658182
C -0.167507
D  1.523331
E  1.556134

‚òÑÔ∏è **Criando uma nova coluna e preenchendo com dados existentes da coluna Y:**

In [5]:
df['new'] = df['Y']
display(df)

          Y         Z         W         X         Q       new
A -0.939426  1.743261 -0.775443  0.230579  1.727765 -0.939426
B  0.658182 -0.122428  0.539046 -0.058211  0.146142  0.658182
C -0.167507 -0.424723  0.185905 -0.738616 -2.292587 -0.167507
D  1.523331 -0.954317 -0.599702  0.221725  0.101403  1.523331
E  1.556134  1.197178 -0.228824 -0.183818 -0.485991  1.556134

üåü  **Criando uma nova coluna e preenchendo com a SOMA dos dados de colunas existentes:**

In [6]:
df['sum'] = df['W'] + df['X']
df

          Y         Z         W         X         Q       new       sum
A -0.939426  1.743261 -0.775443  0.230579  1.727765 -0.939426 -0.544864
B  0.658182 -0.122428  0.539046 -0.058211  0.146142  0.658182  0.480835
C -0.167507 -0.424723  0.185905 -0.738616 -2.292587 -0.167507 -0.552711
D  1.523331 -0.954317 -0.599702  0.221725  0.101403  1.523331 -0.377977
E  1.556134  1.197178 -0.228824 -0.183818 -0.485991  1.556134 -0.412642

‚ùå **DELETANDO UMA DETERMINADA COLUNA**
> O m√©todo df.drop() n√£o altera o DataFrame df original. Ele retorna uma nova c√≥pia do DataFrame sem a coluna 'Y'. Quando utiliz√°-lo, insira para um novo DataFrame.
> 
> Para alterar o DataFrame Original, utilize o par√¢metro: df.drop(inplace=True)

In [7]:
df_Modified = df.drop('Y', axis=1).drop('A', axis=0) # eixo 1 = Colunas -- eixo 0 = Linhas
df_Modified

          Z         W         X         Q       new       sum
B -0.122428  0.539046 -0.058211  0.146142  0.658182  0.480835
C -0.424723  0.185905 -0.738616 -2.292587 -0.167507 -0.552711
D -0.954317 -0.599702  0.221725  0.101403  1.523331 -0.377977
E  1.197178 -0.228824 -0.183818 -0.485991  1.556134 -0.412642

üî± **Acessar linhas e c√©lulas com o M√©todo loc[] --baseado-- em etiquetas:**
> üîπ usado para sele√ß√£o baseada em etiquetas. Isso significa que voc√™ especifica as linhas e colunas que deseja acessar usando r√≥tulos de √≠ndice, em vez de n√∫meros inteiros de posi√ß√£o.

In [8]:
df.loc[['D']] # Visualizando dados DA LINHA 'D' em DataFrame
df.loc[['D', 'C']] # DataFrame da Linha 'D' e 'C'
df.loc['D', 'sum'] # Selecionando uma c√©lula especifica
df.loc[:, 'Q'] # Selecionar uma coluna por r√≥tulo -> IGUAL A: df[['Q']]
df.loc[['D', 'C'], ['new']] # linhas D e C na coluna new -> return celulas em DF
df.loc['C':'D','W':'Q']

          W         X         Q
C  0.185905 -0.738616 -2.292587
D -0.599702  0.221725  0.101403

üî± **Acessar linhas e c√©lulas com o M√©todo iloc[] --baseado-- em posi√ß√£o:**
> üîπ usado para sele√ß√£o baseada em posi√ß√£o. Isso significa que voc√™ especifica as linhas e colunas que deseja acessar usando √≠ndices inteiros.

In [9]:
df.iloc[:3, 2:-1]

          W         X         Q       new
A -0.775443  0.230579  1.727765 -0.939426
B  0.539046 -0.058211  0.146142  0.658182
C  0.185905 -0.738616 -2.292587 -0.167507

üî∞ **FILTROS: SELE√á√ÉO CONDICIONAL**

In [10]:
df[df['W'] > 0]  # retorna um novo DataFrame contendo apenas as linhas onde o valor na coluna "W" √© maior que zero.

          Y         Z         W         X         Q       new       sum
B  0.658182 -0.122428  0.539046 -0.058211  0.146142  0.658182  0.480835
C -0.167507 -0.424723  0.185905 -0.738616 -2.292587 -0.167507 -0.552711

In [11]:
df[(df['W'] > 0) & (df['Q'] > 1)]

Empty DataFrame
Columns: [Y, Z, W, X, Q, new, sum]
Index: []

„ÄΩÔ∏è **MANIPULAR INDICES:**

In [12]:
df.reset_index(inplace=True) # redefine o indice para um novo indice num√©rico e move o anterior como coluna.
df

  index         Y         Z         W         X         Q       new       sum
0     A -0.939426  1.743261 -0.775443  0.230579  1.727765 -0.939426 -0.544864
1     B  0.658182 -0.122428  0.539046 -0.058211  0.146142  0.658182  0.480835
2     C -0.167507 -0.424723  0.185905 -0.738616 -2.292587 -0.167507 -0.552711
3     D  1.523331 -0.954317 -0.599702  0.221725  0.101403  1.523331 -0.377977
4     E  1.556134  1.197178 -0.228824 -0.183818 -0.485991  1.556134 -0.412642

In [13]:
df.set_index('index', inplace=True)
df

              Y         Z         W         X         Q       new       sum
index
A     -0.939426  1.743261 -0.775443  0.230579  1.727765 -0.939426 -0.544864
B      0.658182 -0.122428  0.539046 -0.058211  0.146142  0.658182  0.480835
C     -0.167507 -0.424723  0.185905 -0.738616 -2.292587 -0.167507 -0.552711
D      1.523331 -0.954317 -0.599702  0.221725  0.101403  1.523331 -0.377977
E      1.556134  1.197178 -0.228824 -0.183818 -0.485991  1.556134 -0.412642

üî± **Hierarquia de √≠ndices e √≠ndices M√∫ltiplos**

In [14]:
outside = ['H', 'H','M', 'M']
inside = [1, 2, 1, 2]

hierq_ind = list(zip(outside, inside))

print(hierq_ind)

[('H', 1), ('H', 2), ('M', 1), ('M', 2)]

In [15]:
# transformar em um objeto MultiIndex. Usado como um √≠ndice em um DataFrame do pandas para criar uma estrutura de √≠ndice hier√°rquico.
hierq_ind = pd.MultiIndex.from_tuples(hierq_ind)

In [16]:
df3 = pd.DataFrame(randn(4, 2), index=hierq_ind, columns='A B'.split())
df3

            A         B
H 1  0.017857  0.370544
  2 -1.245655  0.627094
M 1 -0.178525  0.206993
  2 -1.178069 -0.597806

In [17]:
# para renomear esse indices novos criados:
df3.index.names = ['G√™nero', 'N√∫mero']
df3

                      A         B
G√™nero N√∫mero
H      1       0.017857  0.370544
       2      -1.245655  0.627094
M      1      -0.178525  0.206993
       2      -1.178069 -0.597806

In [20]:
# BUSCAS E SELE√á√ÉO:

df3.loc['M'].loc[:, ['A']]
df3.loc['M'].loc[[2]]
df3.loc['M']

               A         B
N√∫mero
1      -0.178525  0.206993
2      -1.178069 -0.597806

> ‚¨áÔ∏è sele√ß√£o das linhas do DataFrame df3 onde o valor do n√≠vel "level='nomeIndiceAqui' √© igual a x. Isso retorna um novo DataFrame ou uma s√©rie, dependendo do contexto em que √© usado, contendo apenas as linhas correspondentes a essa condi√ß√£o.

In [102]:
df3.xs(2, level='N√∫mero')

               A         B
G√™nero
H       0.705210 -0.392516
M      -0.313148 -0.371736

‚ùå **TRATAMENTOS DE DADOS AUSENTES:**

üß∂
> O m√©todo dropna() em Pandas √© usado para remover valores ausentes (NaN) de um DataFrame ou S√©rie.

> Aprenda o df.dropna():
https://bit.ly/3Rnp5GF

In [48]:
import numpy as np

# Criando uma Df com celulas NaN
df_nan = pd.DataFrame({'A': [22734, np.nan, np.nan],'B': [334, 56, np.nan],'C': [5673, 55, np.nan],})
display(df_nan)

         A      B       C
0  22734.0  334.0  5673.0
1      NaN   56.0    55.0
2      NaN    NaN     NaN

In [60]:
df_nan.dropna(axis=1, thresh=0)

         A      B       C
0  22734.0  334.0  5673.0
1      NaN   56.0    55.0
2      NaN    NaN     NaN

üß∂
> O m√©todo fillna() em Pandas √© usado para preencher os valores ausentes (NaN) em um DataFrame ou S√©rie com valores espec√≠ficos que voc√™ fornece.

> Aprenda o df.fillna():
https://bit.ly/45NByaN

In [41]:
df_nan.fillna(0) # Substitua os NaN por 0.

         A      B       C
0  22734.0  334.0  5673.0
1      0.0   56.0    55.0
2      0.0    0.0     0.0

In [63]:
df_nan[['B']].fillna(value=df_nan['B'].mean()) # Substitue o NaN da coluna ou linha pela m√©dia

       B
0  334.0
1   56.0
2  195.0

In [65]:
df_nan.ffill() #  preenche os valores ausentes usando o valor da c√©lula imediatamente acima na mesma coluna.

         A      B       C
0  22734.0  334.0  5673.0
1  22734.0   56.0    55.0
2  22734.0   56.0    55.0